title: Outbound Connection to Potential C2
id: net_connection_win_c2_potential
description: Detects outbound network connection to suspicious IP ranges
group: network
logsource:
    product: windows
    service: sysmon
detection:
    selection:
        event.code: 3
        destination.ip:
            - "203.0.113.99"
            - "198.51.100.5"
            - "5.5.5.5" # C2 test IP
            - "104.248.130.195" # njRAT C2 IP
            - "10.10.10.5" # Covenant C2 IP
    condition: selection
tags:
    - attack.t1071
level: high